## Input Statement

In [12]:
Li = [15, 17 ,18, 20, 19]

age = int(input("how old are you"))
""" input alwways returns a str, hence we convert to int
since age is an int"""
if age in Li:
    print("you are qualified")

if age not in Li: #giving the person another chance
    age= int(input("how old are you again"))
    if age in Li:
        print("you are actually qualified")
    else:
        print("kindly leave")
else:
    print("not qualified")

how old are you1
how old are you again1
kindly leave

Grading
A = 4.5
B = 3 TO 3.5
C = 2.5 - 3
D = BELOW 2.5

In [17]:
score = float(input("what is your score"))
# using float because we are expecting decimals
if score >= 4.5:
    print("Your Grade is A")
    
if score >= 3 and score <=3.5:
    print("Your Grade is B")
    
if score >= 2.5 and score <=3:
    print("Your Grade is C")
    
if score <= 2.5:
    print("Your Grade is D")
    
else:
    print("score not correct: rewrite your exam")

what is your score5
Your Grade is A
score not correct: rewrite your exam

In [18]:
#Tuple: immutable; to change it,
#convert to list first

age = (4, 6, 7, 3 ,6, 'Kola')
A  = list(age)

In [19]:
#let's change Kola to Kola's age
A[-1] = 30
print(A)

[4, 6, 7, 3, 6, 30]

In [24]:
#INDEXING
attendance = ["Yemi", "Kola" , "Kunle"]
attendance[2]

'Kunle'

In [25]:
# In case we dont know the index of Kola
ind_kola = attendance.index("Kola")
ind_kola

1

In [26]:
#let us change Kola to his surname
attendance[ind_kola] = "Osokoya"
print(attendance)

['Yemi', 'Osokoya', 'Kunle']

In [27]:
#List functions
scor = [ 4,6, 12,64, 62,34, 3]
sum(scor) #to check the sum:you can also min, max

185

In [28]:
sorted(scor) #ascending by default

[3, 4, 6, 12, 34, 62, 64]

In [34]:
sorted(scor, reverse = True) 
#for descending

[64, 62, 34, 12, 6, 4, 3]

In [31]:
scor

[4, 6, 12, 64, 62, 34, 3]

In [14]:
#Append and Extend methods
#methods take the in place results internally/ automatically
# and without having to assign another variable
a = ["ade", "yemi", "bolu"]
b = ["ye", "ken"]
a.append(b)
a

#append method will add another list inside a list

['ade', 'yemi', 'bolu', ['ye', 'ken']]

In [2]:
c = ["sade", "yemii", "olu"]
d = ["yeni", "kemi"]
c.extend(d)
c

['sade', 'yemii', 'olu', 'yeni', 'kemi']

In [18]:
#extend method will extend in same list

In [20]:
q = [4,7,3 ,8, 9,54]
sorted(q)

[3, 4, 7, 8, 9, 54]

In [25]:
s = [14,7,3 ,8, 9,54]
s.sort()
s

[3, 7, 8, 9, 14, 54]

In [9]:
# Insert: to positon the element 
names = ["kay", "may","jay"]
names.insert(1, "yeni") 
#insert yeni to index 1
names

['kay', 'yeni', 'may', 'jay']

In [12]:
# pop and remove
# pop removes the last item as def or the indexed
# remove doesn't use index; you have to sate the value

am = [4,65,34,34,32,14]
am.pop()
am

[4, 65, 34, 34, 32]

In [13]:
am.pop(1)
am

[4, 34, 34, 32]

In [19]:
aa = [14,65,134,342,134]
aa.remove(342)
aa

[14, 65, 134, 134]

## LOOP:

In [25]:
# you use loop anytime you know you will 
#repeat same thing multiple times

# e.g. when you want to collect the score of 5 students
# e.g. what is your score
score = input("enter your score")
score = input("enter your score")
score = input("enter your score")

enter your score
enter your score
enter your score

In [26]:
for i in range(5):
    score = input("enter your score")

enter your score
enter your score
enter your score
enter your score
enter your score

In [29]:
#calculate the square
a = [4, 6, 8, 9 , -1]
#without loop
4 ** 2

16

In [30]:
6 ** 2
# we are repeating the instruction multiple time

36

In [34]:
# using loop
for i in a:
    print(i**2)

16
36
64
81
1

In [42]:
# range
list(range(10))

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [40]:
list(range(2, 10))
#specify the starting point

[2, 3, 4, 5, 6, 7, 8, 9]

In [39]:
list(range(2, 20, 3))
#specify the step

[2, 5, 8, 11, 14, 17]

In [1]:
# write a program to collect 5 scores/ numbers
# from users and sum them together
result = 0 # anything added to 0 is that thing
# if we are multiplying, we will use 1
for i in range(5):
    score = float(input("enter your score: "))
    result = result + score
#float takes precedent over interger
#float can work with bont int and float
# while int will give error i one input is a float
print(result)

enter your score: 22
enter your score: 77
enter your score: 44
enter your score: 775
enter your score: 55
973.0

In [14]:
# sum the following
m = [3, 2, 6, 6 ,9,8]

output = 0
for i in m:
    output += i
    
print(output)
output/ len(m)

34

5.666666666666667

In [15]:
# write a programme to find the smallest number
li = [4, 6, 7 ,-4,-6, 2, 98, 76, 54]

#declare an arbitrary number (AN)
# go through each numbers in the list and compare with the AN
# if the number is less than the AN, declare it as the smallest
smallest = None
# we cant use 0 because the number might be less than 0
# and 0 might be in the list
for num in li:
    if smallest is None or smallest > num:
        smallest = num
        
smallest

-6

In [16]:
min(li)

-6

In [17]:
# write a programme to find the maximum number
li = [4, 6, 7 ,-4,-6, 2, 98, 76, 54]

#declare an arbitrary number (AN)
# go through each numbers in the list and compare with the AN
# if the number is less than the AN, declare it as the smallest
highest = None

for num in li:
    if highest is None or highest < num:
        highest = num
        
highest

98

### zip function

In [31]:
#find the profit
cost = [ 35, 65, 98]
price = [56,75, 111]
result = []
for cp, pr in zip(cost, price):
    profit= pr - cp
    result.append(profit)
    print(profit)

21
10
13

In [32]:
print(result)

[21, 10, 13]

### Dictionary

In [49]:
# collect 3 new records
rec = {"Yemi": 45, "Kenny":60, "Kola": 30}
name= input("Pls Enter your name:")
age= int(input("Pls enter your age"))

if name in rec:
    print('name already exists')
else:
    rec[name]= age

print(rec)

Pls Enter your name:kolly
Pls enter your age9
{'Yemi': 45, 'Kenny': 60, 'Kola': 30, 'kolly': 9}

In [4]:
#add the new name and new grade to the student records
student_records= {"tayo": 34, "Mo": 45, "Ayo":65}
new_name = ["Tade", "Ko"]
new_grade = [45,76]
for k,v in zip(new_name, new_grade):
    student_records[k] = v
    
student_records

{'tayo': 34, 'Mo': 45, 'Ayo': 65, 'Tade': 45, 'Ko': 76}

### List Comprehension

In [11]:
# calculate the square from 1- 5
for num in range(1,6):
    print(num**2)

1
4
9
16
25

In [16]:
# list comprehension goes this way
# it includes
#a. the reult of what we are printing
#b.the for loop without the colon
result = [num**2 for num in range(1,6)]
print(result)

[1, 4, 9, 16, 25]

In [34]:
# let's square on the even numbers in 1-5
for i in range(1, 6):
    if i % 2 ==0:
        print(i**2)

4
16

In [40]:
result = [i**2 for i in range(1, 10) if i % 2 ==0]
result

[4, 16, 36, 64]

### Functions

In [54]:
# define add function
def add():
    result = 4+ 5
    print(result)
add()

9

In [55]:
# the above function can only work with 4 and 5
#in cases where we will be changing, we should
# define an argument
def addi(x ,y):
    result = x + y
    return result
addi(8, 9)

17

In [56]:
addi(15 , 19)

34

In [57]:
addi(y = 10,x =100)

110

### Print & Return in function

In [59]:
def mat(x ,y):
    result = x + y
    print(result)

In [83]:
mat(34,67)

101

In [84]:
val = mat(23, 5) #it could also print like this

28

In [69]:
print(val) #nothing gets printed, so above is useless

None

In [74]:
def matt(x ,y):
    resultt = x + y
    return resultt

In [85]:
vall = matt(3,4)
print(vall) #it prints the newly assigned variabe

7

In [79]:
matt(45,67)

112

In [80]:
mat(23, 5)

28

In [86]:
# write a function to print Hello Kola 5 times
for i in range(5):
    print("Hello Kola")

Hello Kola
Hello Kola
Hello Kola
Hello Kola
Hello Kola

In [100]:
def greetings():
    for i in range(5):
        print("Hello Kola")
greetings()

Hello Kola
Hello Kola
Hello Kola
Hello Kola
Hello Kola

In [103]:
def greetings(name):
    for i in range(5):
        print(f"Hello {name}")
greetings("Kenny")

Hello Kenny
Hello Kenny
Hello Kenny
Hello Kenny
Hello Kenny

In [97]:
y = greetings()

In [104]:
# Default argument in function
#note: your default should always come last
def add(z, y = 9):
    result= z + y
    return result

In [108]:
add(z = 5)

14

In [109]:
# I can still change the y
add(z = 5, y = 10)

15

### Global, local, scope

In [118]:
#1. LOCAL: known within the function they are defined
#define a function to check if a numberr is odd
def oddcheck(x):
    if x % 2 == 1:
        print("the number is odd")
    else:
        print("the number is even")

In [119]:
oddcheck(x=17)

the number is odd

In [130]:
y = 70

def oddcheck(x):
    if x % 2 == 1:
        print("the number is odd")
    elif y % 2 == 0:
        print("this is even")
    else:
        print("the number is even")

In [131]:
oddcheck(x = 8)

this is even

In [163]:
# write a function that accepts a list of any length as input
# program should check for -1 in the list
# return index if it is present otherwise return None
result = []
def indexcheck(number):
    for i in number:
        if i < 0:
            return number.index(i)
    return None

In [168]:
A =[5, 7, -8, 65, 89]
indexcheck(A)

2

In [171]:
# return none is outseide the if statement
# it first sees 5 then it goes back to the loop to check oda nos
# if an else to return none is inside the if, once itgrabs the 1st no,
#it will print out none if the no is even
# if no -ve is found it will return none
B = [5, 7, 8, 18, 65, 89]
i = indexcheck(B)
type(i)

NoneType

## create a function to add new names and new grades to a dictionary

In [7]:
student_grades = {"Kola":67, "Kay":76, "Bayo":56}
new_names = ["Femi", "Ay" , "Dami"]
new_grades = [45,67,34]

In [10]:
result = {}
def sch_grades(names, grades):
    for k,v in zip(names, grades):
        result[k] = v
    return result

In [11]:
result = sch_grades(new_names, new_grades)
result

{'Femi': 45, 'Ay': 67, 'Dami': 34}

In [12]:
student_grades.update(result)
student_grades

{'Kola': 67, 'Kay': 76, 'Bayo': 56, 'Femi': 45, 'Ay': 67, 'Dami': 34}

### write a function that shows only those with 60 and above

In [37]:
good_students = {}
def sixty_plus(dict1):
    for k,v in dict1.items():
        if v >= 60:
            good_students[k]=v
    return good_students

In [39]:
sixty_plus(student_grades)

{'Kola': 67, 'Kay': 76, 'Ay': 67}

### Lambda function

In [40]:
def add_10(x):
    return x + 10

In [41]:
add_10(56)

66

In [42]:
add_ten = lambda x: x+10
add_ten(67)

77

In [44]:
# a lambda function that multiplies arg a with b
mult = lambda a,b,c : (a*b)/c
mult(8,48, 24)

16.0

### CLASS

In [71]:
class Person:
    def __init__(self,name, age): #initializing the class
        self.fname = name
        self.fage = age
        
    def greeting(self):
        print("Welcome!", "Your name and age are:", self.fname, "&", self.fage)
        
    def setName(self, new_name):
        self.fname = new_name
        
    def getName(self):
        return self.fname

In [86]:
#declare a class
person1 = Person("kola", 32)
person1.greeting()

Welcome! Your name and age are: kola & 32

In [87]:
person1.getName()

'kola'

In [88]:
person1.setName("Gbenga")
person1.getName()

'Gbenga'

### Class Inheritance

In [77]:
# create a sample child class from the Person class
class Member(Person):
    pass
# member automatically inherits Parent class

In [78]:
member1 = Member("Olufemi", 27)
member1.getName()

'Olufemi'

In [90]:
#in case we want to update an inherited class,
# we use super() - to initialize a child class
class Members(Person):
    def __init__(self, name, age, subject):
        super().__init__(name, age)
        self.sub = subject

In [89]:
# create an instance of the child class and access a method
members1 = Members("Kenny", 27 ,"AI")
members1.getName()

'Kenny'

## Designing Programs using Python Classes

Discussion 1; write a program to model a dog; the dog should have an age and name. the dog should be able to sit and rollover

In [103]:
class Dog():
    def __init__(self, name, age):
        self.name = name
        self.age = age
    def sit(self):
        print(self.name + " is sitting on the couch")
    def rollOver(self):
        print(self.name + " has rolled over")

In [104]:
dog1 = Dog("Wee", 5)
dog1.name

'Wee'

In [105]:
dog1.sit()

Wee is sitting on the couch

In [106]:
dog1.rollOver()

Wee has rolled over

Discussion 2; make a class called restaurant. the restaurant has 2 attribute- the class name and the cuisine_type. Make a method called describe_restaurant that prints two informationand a method called open_restaurants that prints a message showing the restaurant is opened <br>
-Add another attribute callednumber_served(0 with a default number of 0 <br>
-add a method called set_number_served() that let's you see the number of customers thathave been served <br>
-add a method called increase_number_served() that let's you increase the number of customers thathave been served

In [262]:
class Restaurant():
    def __init__(self, name, cuisine_type):
        self.name= name
        self.cuisine_type = cuisine_type
        self.number_served = 0
    def describe_restaurant(self):
        print(self.name + " offers various types of "+ self.cuisine_type)
    def open_restaurant(self):
        print("At", self.name + ", we are open to serve you "+ self.cuisine_type)    
    def set_number_served(self, num):
        self.number_served = num
    def increase_number_served(self, num):
        self.number_served += num
        #print("We just served " + str(num) + " number of people! this gives "
        #      +str(self.number_served))
        """to concatenate without the + sign, you can add f before the string"""
        print(f"We just served {num} number of people! This gives {self.number_served}")

In [263]:
res1 = Restaurant("McDonald", "Burger")
res1.name

'McDonald'

In [264]:
res1.cuisine_type

'Burger'

In [265]:
res1.describe_restaurant()

McDonald offers various types of Burger

In [266]:
res1.open_restaurant()

At McDonald, we are open to serve you Burger

In [267]:
res1.number_served

0

In [268]:
res1.set_number_served(30)

In [269]:
res1.number_served

30

In [270]:
res1.increase_number_served(20)

We just served 20 number of people! This gives 50

Discussion 3: Make a class called User with two attributes: first_name and last_name. you can create other attributes typically stored in a user profile <br>
-make a method called decribe_user() that prints a summary of user info <br>
-make a method called greet_user() that prints a personalized greeting to an user <br>
-add a attribute called login_attempt to your User class <br>
-write a method called increment_login_attempt() that increments the value of login_attempt by 1 <br>
-write a method called reset_login_attempt() that resets the number of login_attempt to 0 <br>

In [284]:
class User():
    login_attempt= 1 #declaring it outside the mtd since we wont be changing it
    def __init__(self, first_name, last_name):
        self.name= first_name
        self.last_name = last_name
        self.login_attempt = 0
    def increase_login_attempt(self):
        self.login_attempt +=1 
        print(f"login attempt is {self.login_attempt}")

In [285]:
user1 = User("Kola", "Oso")
user1.name

'Kola'

In [286]:
user1.login_attempt

0

In [288]:
user1.increase_login_attempt()

login attempt is 1

## Introduction to Pandas

### DATA EXPLORATION

import pandas as pd

In [292]:
df = pd.read_csv(r"E:\Libraries\Downloads\Employee.csv")
df.head()

,jobTitle,gender,age,perfEval,edu,dept,seniority,basePay,bonus
0,Graphic Designer,Female,18,5,College,Operations,2,42363,9938
1,Software Engineer,Male,21,5,College,Management,5,108476,11128
2,Warehouse Associate,Female,19,4,PhD,Administration,5,90208,9268
3,Software Engineer,Male,20,5,Masters,Sales,4,108080,10154
4,Graphic Designer,Male,26,5,Masters,Engineering,5,99464,9319

### Data info
df.info: this gives comprehensive info about our data such as no of row, column,rows that are not empty , types of variables, etc. <br>
others include: .dtype, .shape

In [293]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   jobTitle   1000 non-null   object
 1   gender     1000 non-null   object
 2   age        1000 non-null   int64
 3   perfEval   1000 non-null   int64
 4   edu        1000 non-null   object
 5   dept       1000 non-null   object
 6   seniority  1000 non-null   int64
 7   basePay    1000 non-null   int64
 8   bonus      1000 non-null   int64
dtypes: int64(5), object(4)
memory usage: 70.4+ KB

### Missing values
df.isnull().sum(): sum of missing values

In [295]:
df.isnull().sum()

jobTitle     0
gender       0
age          0
perfEval     0
edu          0
dept         0
seniority    0
basePay      0
bonus        0
dtype: int64

###### NO MISSING VALUES

just because there are no missing values doesn.t meant the entries are correct. some might use Age of 0, this is technically a missing value

### Missing strings
df.isna().sum() <br>
df.isna().isnull().sum() for missing string + missing values

In [298]:
df.isna().isnull().sum()

jobTitle     0
gender       0
age          0
perfEval     0
edu          0
dept         0
seniority    0
basePay      0
bonus        0
dtype: int64

### Unique  column entries
df.Age.unique( )  - shows all the unique entries in a variable <br>
df.Age.nuique ( ) shows the number of all the unique entries in a variable <br>

in cases the variable has spaces in it, a more universal way is <br>
df[Age of Members].unique(  <br>
df[Age of Members].nunique( ) <br>

In [299]:
df["jobTitle"].unique()

array(['Graphic Designer', 'Software Engineer', 'Warehouse Associate',
       'IT', 'Sales Associate', 'Driver', 'Financial Analyst',
       'Marketing Associate', 'Data Scientist', 'Manager'], dtype=object)

In [300]:
df["gender"].nunique() # 2 genders are present which are male and female

2

### Unique Statitstics/ Occurences -column entries including empty strings
df[Age of Members].value_counts(): show each unique entries with the numbers.

In [326]:
df["dept"].value_counts()

Operations        210
Sales             207
Management        198
Administration    193
Engineering       192
Name: dept, dtype: int64

### Duplicates
these are when 2 or more rows have same info/entries across all the columns<br>
i.e. same name, same age, same job type, same gender, etc. the law of statisctics  allow us to drop them<br>
because we only need one instance of Kola and one instance of Kenny<br>
df.duplcated().sum()  to check duplicates <br>
df[df.duplicated() == True] <br>
df.drop_duplicates()  to delete them<br>

In [310]:
df.duplicated().sum() #no duplicates in the data

0

In [334]:
df[df.duplicated() == True]

Empty DataFrame
Columns: [jobTitle, gender, Age, perfEval, edu, dept, seniority, basePay, bonus]
Index: []

### Decriptive Statistics:
df.describe is used which show only the numeric by default <br>
df.describe(include = "all").T -for all variables

In [325]:
df.describe(include = "all").T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
jobTitle,1000,10,Marketing Associate,118,NaN,NaN,NaN,NaN,NaN,NaN,NaN
gender,1000,2,Male,532,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Age,1000.0,NaN,NaN,NaN,41.393,14.294856,18.0,29.0,41.0,54.25,65.0
perfEval,1000.0,NaN,NaN,NaN,3.037,1.423959,1.0,2.0,3.0,4.0,5.0
edu,1000,4,High School,265,NaN,NaN,NaN,NaN,NaN,NaN,NaN
dept,1000,5,Operations,210,NaN,NaN,NaN,NaN,NaN,NaN,NaN
seniority,1000.0,NaN,NaN,NaN,2.971,1.395029,1.0,2.0,3.0,4.0,5.0
basePay,1000.0,NaN,NaN,NaN,94472.653,25337.493272,34208.0,76850.25,93327.5,111558.0,179726.0
bonus,1000.0,NaN,NaN,NaN,6467.161,2004.377365,1703.0,4849.5,6507.0,8026.0,11293.0

### Correlation - Quantitative variables only
it measure the relationship between two quantitative variables. Any value above 0.7 is high. 0.9 is very high <br>
below 0.3 is low <br>
0.3  0.6  moderate correlation <br>
0.6-0.8 i.e. 60- 80% : high <br>
0.9/ 90% and above : very high correlation <br>

+1 = high positive correlation  as one increases the other increases  <br>
-1 = high negative correlation  as one increases the other decreases <br>
df.corr()  this will bring out all the correlation of all quantitative variables <br>

In [311]:
df.corr()

                age  perfEval  seniority   basePay     bonus
age        1.000000 -0.056875  -0.021414  0.562681 -0.414337
perfEval  -0.056875  1.000000  -0.021127 -0.053622  0.855500
seniority -0.021414 -0.021127   1.000000  0.511096  0.194982
basePay    0.562681 -0.053622   0.511096  1.000000 -0.129481
bonus     -0.414337  0.855500   0.194982 -0.129481  1.000000

-	There is a corr btw Age and Basepay meaning as an employee gets older, their salary increases
-	There is a corr (-ve) btw Age and bonus meaning as an employee gets older, the bonus he receives reduces
-	As seniority level increase, salary increases. however the bonus received is not dependent on the seniority level as seen from the 0.19corr 
-	Bonus is highly dependent on the performance evaluation- with a corr of 0.85

### Filtering daaframe to numeric and categorical and manually
numeric  - df.select_dtypes(include = number) <br>
categorical -df.select_dtypes(include = object) or exclude = number <br>
manually  df[[Age,Gender,Salary]].head() <br>

In [314]:
df.select_dtypes(include = "number").head()

   age  perfEval  seniority  basePay  bonus
0   18         5          2    42363   9938
1   21         5          5   108476  11128
2   19         4          5    90208   9268
3   20         5          4   108080  10154
4   26         5          5    99464   9319

In [315]:
df.select_dtypes(exclude = "number").head()

              jobTitle  gender      edu            dept
0     Graphic Designer  Female  College      Operations
1    Software Engineer    Male  College      Management
2  Warehouse Associate  Female      PhD  Administration
3    Software Engineer    Male  Masters           Sales
4     Graphic Designer    Male  Masters     Engineering

In [317]:
df[["age","gender","basePay"]].head()

   age  gender  basePay
0   18  Female    42363
1   21    Male   108476
2   19  Female    90208
3   20    Male   108080
4   26    Male    99464

In [341]:
# We can use the index to select the last 5
df[["Age","gender","basePay"]][-5:]

     Age  gender  basePay
995   61  Female    62644
996   57    Male   108977
997   48    Male    92347
998   65    Male    97376
999   60    Male   123108

#### Renaming a column
there is a dictionary inside the reaname method containing a key and value representing the old and new name

In [377]:
df.rename(columns =  {"age": "Age"}, inplace = True)
df.head()

,jobTitle,gender,Age,perfEval,edu,dept,seniority,basePay,bonus
0,Graphic Designer,Female,18,5,College,Operations,2,42363,9938
1,Software Engineer,Male,21,5,College,Management,5,108476,11128
2,Warehouse Associate,Female,19,4,PhD,Administration,5,90208,9268
3,Software Engineer,Male,20,5,Masters,Sales,4,108080,10154
4,Graphic Designer,Male,26,5,Masters,Engineering,5,99464,9319

### DATA MANIPULATION

### Data Subsetting - loc & iloc : extracting selected row and columns
the loc and iloc are used to subset the row entries. they are not really methods hence they use the[] sign <br>
the row and column are seperated by a comma [row , column]  e.g.[1, 2:3], [1, :]  <br>
**loc**: subsetbased on the row label: has 2 argument i.e. the pandas row label and the columns of choice. this works with the index label given by pandas <br>
**iloc**: Subsets based on the row index or number- this works with python indices i.e -1, -2, :, 1:, etc

In [343]:
df.loc[0, ['Age', "edu", "gender"]] # for first row

Age            18
edu       College
gender     Female
Name: 0, dtype: object

In [348]:
df.loc[:3, ['Age', "edu", "gender"]] # for first 4 row

   Age      edu  gender
0   18  College  Female
1   21  College    Male
2   19      PhD  Female
3   20  Masters    Male

In [351]:
df.loc[[2,111, 543], ['Age', "edu", "gender"]] # for selected rows

     Age      edu  gender
2     19      PhD  Female
111   26  College    Male
543   25  College    Male

In [355]:
df.loc[999, ['Age', "edu", "gender"]] # for last row

Age         60
edu        PhD
gender    Male
Name: 999, dtype: object

In [358]:
df.iloc[-1, [1,2,3]] # for last row

gender      Male
Age           60
perfEval       1
Name: 999, dtype: object

In [360]:
df.iloc[0, :] #for first row and all columns

jobTitle     Graphic Designer
gender                 Female
Age                        18
perfEval                    5
edu                   College
dept               Operations
seniority                   2
basePay                 42363
bonus                    9938
Name: 0, dtype: object

In [361]:
df.iloc[[0,5,7], [2,4,5]] #for selected row and selected columns

   Age      edu         dept
0   18  College   Operations
5   20      PhD   Operations
7   18      PhD  Engineering

since it is difficult to assess the indices of columns in iloc, it is recommendedto use loc by passing the name of the columns

### Data Filtering - extracting all datasets using selected values/entries of a column as basis
subsetting is different for filtering <br>
- subsetting is selecting filtering selected rows and columns of a dataset e.g. to view the columns of Gender <br>
- filtering is viewing the complete dataset of a particular entry of a column in the data e.g viewing the dataset of everyone with age 10 or dataset of all Software Engineers

In [364]:
#let's get the dataset of all software engineers
df[df["jobTitle"]== "Software Engineer"]

,jobTitle,gender,Age,perfEval,edu,dept,seniority,basePay,bonus
1,Software Engineer,Male,21,5,College,Management,5,108476,11128
3,Software Engineer,Male,20,5,Masters,Sales,4,108080,10154
7,Software Engineer,Male,18,4,PhD,Engineering,5,97523,10240
24,Software Engineer,Male,21,4,PhD,Engineering,5,132823,9625
26,Software Engineer,Male,19,5,Masters,Administration,4,100305,9618
...,...,...,...,...,...,...,...,...,...
948,Software Engineer,Male,36,1,Masters,Operations,1,93855,4099
968,Software Engineer,Male,62,1,High School,Sales,3,132815,3367
971,Software Engineer,Male,60,1,High School,Administration,3,106045,3079
973,Software Engineer,Male,64,1,Masters,Sales,1,109606,2193
982,Software Engineer,Male,62,1,High School,Management,3,119069,2788

In [370]:
df.loc[999, ["jobTitle"]]

jobTitle    Financial Analyst
Name: 999, dtype: object

In [372]:
#let's get the dataset of all those with age 60
df[df["Age"]== 60].head()

,jobTitle,gender,Age,perfEval,edu,dept,seniority,basePay,bonus
357,Manager,Female,60,4,PhD,Management,3,160614,8354
399,Financial Analyst,Male,60,5,High School,Engineering,4,121728,7932
429,Software Engineer,Male,60,4,Masters,Sales,5,155676,6586
446,Software Engineer,Male,60,3,PhD,Management,5,145632,6439
512,Manager,Male,60,4,College,Sales,2,148178,6777

#### Query Method- Data Filtering

In [375]:
#let's get the dataset of all software engineers
df.query("jobTitle == 'Software Engineer'")

,jobTitle,gender,Age,perfEval,edu,dept,seniority,basePay,bonus
1,Software Engineer,Male,21,5,College,Management,5,108476,11128
3,Software Engineer,Male,20,5,Masters,Sales,4,108080,10154
7,Software Engineer,Male,18,4,PhD,Engineering,5,97523,10240
24,Software Engineer,Male,21,4,PhD,Engineering,5,132823,9625
26,Software Engineer,Male,19,5,Masters,Administration,4,100305,9618
...,...,...,...,...,...,...,...,...,...
948,Software Engineer,Male,36,1,Masters,Operations,1,93855,4099
968,Software Engineer,Male,62,1,High School,Sales,3,132815,3367
971,Software Engineer,Male,60,1,High School,Administration,3,106045,3079
973,Software Engineer,Male,64,1,Masters,Sales,1,109606,2193
982,Software Engineer,Male,62,1,High School,Management,3,119069,2788

In [376]:
#let's get the dataset of all those with age 60
df.query("Age== 60").head()

,jobTitle,gender,Age,perfEval,edu,dept,seniority,basePay,bonus
357,Manager,Female,60,4,PhD,Management,3,160614,8354
399,Financial Analyst,Male,60,5,High School,Engineering,4,121728,7932
429,Software Engineer,Male,60,4,Masters,Sales,5,155676,6586
446,Software Engineer,Male,60,3,PhD,Management,5,145632,6439
512,Manager,Male,60,4,College,Sales,2,148178,6777

#### filtering multiple entries

In [382]:
df[(df["jobTitle"]== "Software Engineer") & (df["edu"]== "Masters")].head(5)

,jobTitle,gender,Age,perfEval,edu,dept,seniority,basePay,bonus
3,Software Engineer,Male,20,5,Masters,Sales,4,108080,10154
26,Software Engineer,Male,19,5,Masters,Administration,4,100305,9618
30,Software Engineer,Male,20,5,Masters,Management,2,66359,10137
44,Software Engineer,Male,25,5,Masters,Sales,5,119024,11293
45,Software Engineer,Male,22,5,Masters,Management,3,81503,9729

In [390]:
df.query("jobTitle == 'Software Engineer' & edu == 'Masters'").head(4) # and can also be used

,jobTitle,gender,Age,perfEval,edu,dept,seniority,basePay,bonus
3,Software Engineer,Male,20,5,Masters,Sales,4,108080,10154
26,Software Engineer,Male,19,5,Masters,Administration,4,100305,9618
30,Software Engineer,Male,20,5,Masters,Management,2,66359,10137
44,Software Engineer,Male,25,5,Masters,Sales,5,119024,11293

In [393]:
df.query("jobTitle == 'Software Engineer' | edu == 'Masters'").head(4) # or can also be used. here either condition will be printed

,jobTitle,gender,Age,perfEval,edu,dept,seniority,basePay,bonus
1,Software Engineer,Male,21,5,College,Management,5,108476,11128
3,Software Engineer,Male,20,5,Masters,Sales,4,108080,10154
4,Graphic Designer,Male,26,5,Masters,Engineering,5,99464,9319
7,Software Engineer,Male,18,4,PhD,Engineering,5,97523,10240

In [397]:
df.query("jobTitle == 'Software Engineer' & Age >= 65")
# ONLY 4 software engineers are older than 65

,jobTitle,gender,Age,perfEval,edu,dept,seniority,basePay,bonus
350,Software Engineer,Male,65,4,High School,Management,5,157852,6669
374,Software Engineer,Male,65,5,Masters,Sales,1,134758,7500
443,Software Engineer,Male,65,4,High School,Engineering,1,102597,5937
741,Software Engineer,Male,65,3,High School,Sales,2,122624,4165

#### Discussion - filtering
1. find the average base salary for data scientists who are phd holders

In [398]:
# here we need jobTitle, basepay and edu column

In [406]:
df.query("jobTitle == 'Data Scientist' and edu == 'PhD'").head()

,jobTitle,gender,Age,perfEval,edu,dept,seniority,basePay,bonus
34,Data Scientist,Female,45,5,PhD,Management,5,113252,10139
40,Data Scientist,Male,29,5,PhD,Administration,5,96355,9784
41,Data Scientist,Male,32,5,PhD,Management,3,87121,8703
46,Data Scientist,Female,21,5,PhD,Operations,3,70643,10033
68,Data Scientist,Male,18,5,PhD,Administration,4,59212,10209

In [407]:
df.query("jobTitle == 'Data Scientist' and edu == 'PhD'")["basePay"].mean()

98262.4827586207

### Grouped and Aggregated Calculation

In [414]:
# find the average base salary for data scientists at all levels of education
df.query("jobTitle == 'Data Scientist'")["basePay"].mean()
#average salary of all data scientist

92433.42056074766

In [415]:
df.query("jobTitle == 'Data Scientist'").groupby("edu")["basePay"].mean()
#average salary of all data scientist at all levels of education

edu
College         87545.600000
High School     79332.862069
Masters        103075.827586
PhD             98262.482759
Name: basePay, dtype: float64

In [417]:
df.query("jobTitle == 'Data Scientist'").groupby("edu")["basePay"].mean().sort_values(ascending= False)

edu
Masters        103075.827586
PhD             98262.482759
College         87545.600000
High School     79332.862069
Name: basePay, dtype: float64

In [423]:
#2. calculate the average base pay and median bous for each department
df.groupby("dept")["basePay"].mean()

dept
Administration    91692.025907
Engineering       96492.552083
Management        96492.974747
Operations        90072.823810
Sales             97722.801932
Name: basePay, dtype: float64

In [425]:
df.groupby("dept")["bonus"].median()

dept
Administration    6581.0
Engineering       6630.5
Management        6556.0
Operations        6492.5
Sales             6179.0
Name: bonus, dtype: float64

In [428]:
df.groupby("dept")[["basePay","bonus"]].mean()

                     basePay        bonus
dept
Administration  91692.025907  6434.590674
Engineering     96492.552083  6770.442708
Management      96492.974747  6619.757576
Operations      90072.823810  6345.900000
Sales           97722.801932  6193.280193

In [432]:
#in order to call both mean and median, Aggregrate methd will be used
df.groupby("dept").agg({"basePay":"mean","bonus":"median"})

                     basePay   bonus
dept
Administration  91692.025907  6581.0
Engineering     96492.552083  6630.5
Management      96492.974747  6556.0
Operations      90072.823810  6492.5
Sales           97722.801932  6179.0

In [439]:
#in order to call both mean and median, Aggregrate methd will be used
df.groupby("dept").agg({"basePay":"mean","bonus":"median"}).round(2).sort_values(ascending = False, by= "bonus")
# by is used because python recognizes a dictionary and not a pandas dataframe

                 basePay   bonus
dept
Engineering     96492.55  6630.5
Administration  91692.03  6581.0
Management      96492.97  6556.0
Operations      90072.82  6492.5
Sales           97722.80  6179.0

In [449]:
#3.what is the ratio of males to females who are PhD holder
df.query("edu =='PhD'")["gender"].value_counts()

Male      132
Female    106
Name: gender, dtype: int64